Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_curiosity_pro/pic32cm_ls00_cpro_tz_getting_started/firmware/Secure/firmware/src/packs/PIC32CM5164LS00100_DFP/component/evsys.h
#define EVSYS_NONSECUSER1_USER32_Pos          _UINT32_(0)                                          /* (EVSYS_NONSECUSER1) Non-Secure for User 32 Position */
#define EVSYS_NONSECUSER1_USER32_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER32_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 32 Mask */
#define EVSYS_NONSECUSER1_USER32(value)       (EVSYS_NONSECUSER1_USER32_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER32_Pos)) /* Assigment of value for USER32 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER33_Pos          _UINT32_(1)                                          /* (EVSYS_NONSECUSER1) Non-Secure for User 33 Position */
#define EVSYS_NONSECUSER1_USER33_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER33_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 33 Mask */
#define EVSYS_NONSECUSER1_USER33(value)       (EVSYS_NONSECUSER1_USER33_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER33_Pos)) /* Assigment of value for USER33 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER34_Pos          _UINT32_(2)                                          /* (EVSYS_NONSECUSER1) Non-Secure for User 34 Position */
#define EVSYS_NONSECUSER1_USER34_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER34_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 34 Mask */
#define EVSYS_NONSECUSER1_USER34(value)       (EVSYS_NONSECUSER1_USER34_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER34_Pos)) /* Assigment of value for USER34 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER35_Pos          _UINT32_(3)                                          /* (EVSYS_NONSECUSER1) Non-Secure for User 35 Position */
#define EVSYS_NONSECUSER1_USER35_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER35_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 35 Mask */
#define EVSYS_NONSECUSER1_USER35(value)       (EVSYS_NONSECUSER1_USER35_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER35_Pos)) /* Assigment of value for USER35 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER36_Pos          _UINT32_(4)                                          /* (EVSYS_NONSECUSER1) Non-Secure for User 36 Position */
#define EVSYS_NONSECUSER1_USER36_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER36_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 36 Mask */
#define EVSYS_NONSECUSER1_USER36(value)       (EVSYS_NONSECUSER1_USER36_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER36_Pos)) /* Assigment of value for USER36 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER37_Pos          _UINT32_(5)                                          /* (EVSYS_NONSECUSER1) Non-Secure for User 37 Position */
#define EVSYS_NONSECUSER1_USER37_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER37_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 37 Mask */
#define EVSYS_NONSECUSER1_USER37(value)       (EVSYS_NONSECUSER1_USER37_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER37_Pos)) /* Assigment of value for USER37 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER38_Pos          _UINT32_(6)                                          /* (EVSYS_NONSECUSER1) Non-Secure for User 38 Position */
#define EVSYS_NONSECUSER1_USER38_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER38_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 38 Mask */
#define EVSYS_NONSECUSER1_USER38(value)       (EVSYS_NONSECUSER1_USER38_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER38_Pos)) /* Assigment of value for USER38 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER39_Pos          _UINT32_(7)                                          /* (EVSYS_NONSECUSER1) Non-Secure for User 39 Position */
#define EVSYS_NONSECUSER1_USER39_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER39_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 39 Mask */
#define EVSYS_NONSECUSER1_USER39(value)       (EVSYS_NONSECUSER1_USER39_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER39_Pos)) /* Assigment of value for USER39 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER40_Pos          _UINT32_(8)                                          /* (EVSYS_NONSECUSER1) Non-Secure for User 40 Position */
#define EVSYS_NONSECUSER1_USER40_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER40_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 40 Mask */
#define EVSYS_NONSECUSER1_USER40(value)       (EVSYS_NONSECUSER1_USER40_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER40_Pos)) /* Assigment of value for USER40 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER41_Pos          _UINT32_(9)                                          /* (EVSYS_NONSECUSER1) Non-Secure for User 41 Position */
#define EVSYS_NONSECUSER1_USER41_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER41_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 41 Mask */
#define EVSYS_NONSECUSER1_USER41(value)       (EVSYS_NONSECUSER1_USER41_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER41_Pos)) /* Assigment of value for USER41 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER42_Pos          _UINT32_(10)                                         /* (EVSYS_NONSECUSER1) Non-Secure for User 42 Position */
#define EVSYS_NONSECUSER1_USER42_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER42_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 42 Mask */
#define EVSYS_NONSECUSER1_USER42(value)       (EVSYS_NONSECUSER1_USER42_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER42_Pos)) /* Assigment of value for USER42 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER43_Pos          _UINT32_(11)                                         /* (EVSYS_NONSECUSER1) Non-Secure for User 43 Position */
#define EVSYS_NONSECUSER1_USER43_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER43_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 43 Mask */
#define EVSYS_NONSECUSER1_USER43(value)       (EVSYS_NONSECUSER1_USER43_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER43_Pos)) /* Assigment of value for USER43 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER44_Pos          _UINT32_(12)                                         /* (EVSYS_NONSECUSER1) Non-Secure for User 44 Position */
#define EVSYS_NONSECUSER1_USER44_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER44_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 44 Mask */
#define EVSYS_NONSECUSER1_USER44(value)       (EVSYS_NONSECUSER1_USER44_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER44_Pos)) /* Assigment of value for USER44 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER45_Pos          _UINT32_(13)                                         /* (EVSYS_NONSECUSER1) Non-Secure for User 45 Position */
#define EVSYS_NONSECUSER1_USER45_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER45_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 45 Mask */
#define EVSYS_NONSECUSER1_USER45(value)       (EVSYS_NONSECUSER1_USER45_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER45_Pos)) /* Assigment of value for USER45 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER46_Pos          _UINT32_(14)                                         /* (EVSYS_NONSECUSER1) Non-Secure for User 46 Position */
#define EVSYS_NONSECUSER1_USER46_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER46_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 46 Mask */
#define EVSYS_NONSECUSER1_USER46(value)       (EVSYS_NONSECUSER1_USER46_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER46_Pos)) /* Assigment of value for USER46 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER47_Pos          _UINT32_(15)                                         /* (EVSYS_NONSECUSER1) Non-Secure for User 47 Position */
#define EVSYS_NONSECUSER1_USER47_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER47_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 47 Mask */
#define EVSYS_NONSECUSER1_USER47(value)       (EVSYS_NONSECUSER1_USER47_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER47_Pos)) /* Assigment of value for USER47 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER48_Pos          _UINT32_(16)                                         /* (EVSYS_NONSECUSER1) Non-Secure for User 48 Position */
#define EVSYS_NONSECUSER1_USER48_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER48_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 48 Mask */
#define EVSYS_NONSECUSER1_USER48(value)       (EVSYS_NONSECUSER1_USER48_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER48_Pos)) /* Assigment of value for USER48 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER49_Pos          _UINT32_(17)                                         /* (EVSYS_NONSECUSER1) Non-Secure for User 49 Position */
#define EVSYS_NONSECUSER1_USER49_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER49_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 49 Mask */
#define EVSYS_NONSECUSER1_USER49(value)       (EVSYS_NONSECUSER1_USER49_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER49_Pos)) /* Assigment of value for USER49 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER50_Pos          _UINT32_(18)                                         /* (EVSYS_NONSECUSER1) Non-Secure for User 50 Position */
#define EVSYS_NONSECUSER1_USER50_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER50_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 50 Mask */
#define EVSYS_NONSECUSER1_USER50(value)       (EVSYS_NONSECUSER1_USER50_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER50_Pos)) /* Assigment of value for USER50 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_USER51_Pos          _UINT32_(19)                                         /* (EVSYS_NONSECUSER1) Non-Secure for User 51 Position */
#define EVSYS_NONSECUSER1_USER51_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER1_USER51_Pos)      /* (EVSYS_NONSECUSER1) Non-Secure for User 51 Mask */
#define EVSYS_NONSECUSER1_USER51(value)       (EVSYS_NONSECUSER1_USER51_Msk & (_UINT32_(value) << EVSYS_NONSECUSER1_USER51_Pos)) /* Assigment of value for USER51 in the EVSYS_NONSECUSER1 register */
#define EVSYS_NONSECUSER1_Msk                 _UINT32_(0x000FFFFF)                                 /* (EVSYS_NONSECUSER1) Register Mask  */

