Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_curiosity_pro/pic32cm_ls00_cpro_tz_getting_started/firmware/Secure/firmware/src/packs/PIC32CM5164LS00100_DFP/component/evsys.h
#define EVSYS_NSCHKUSER1_USER32_Pos           _UINT32_(0)                                          /* (EVSYS_NSCHKUSER1) User 32 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER32_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER32_Pos)       /* (EVSYS_NSCHKUSER1) User 32 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER32(value)        (EVSYS_NSCHKUSER1_USER32_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER32_Pos)) /* Assigment of value for USER32 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER33_Pos           _UINT32_(1)                                          /* (EVSYS_NSCHKUSER1) User 33 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER33_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER33_Pos)       /* (EVSYS_NSCHKUSER1) User 33 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER33(value)        (EVSYS_NSCHKUSER1_USER33_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER33_Pos)) /* Assigment of value for USER33 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER34_Pos           _UINT32_(2)                                          /* (EVSYS_NSCHKUSER1) User 34 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER34_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER34_Pos)       /* (EVSYS_NSCHKUSER1) User 34 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER34(value)        (EVSYS_NSCHKUSER1_USER34_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER34_Pos)) /* Assigment of value for USER34 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER35_Pos           _UINT32_(3)                                          /* (EVSYS_NSCHKUSER1) User 35 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER35_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER35_Pos)       /* (EVSYS_NSCHKUSER1) User 35 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER35(value)        (EVSYS_NSCHKUSER1_USER35_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER35_Pos)) /* Assigment of value for USER35 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER36_Pos           _UINT32_(4)                                          /* (EVSYS_NSCHKUSER1) User 36 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER36_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER36_Pos)       /* (EVSYS_NSCHKUSER1) User 36 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER36(value)        (EVSYS_NSCHKUSER1_USER36_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER36_Pos)) /* Assigment of value for USER36 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER37_Pos           _UINT32_(5)                                          /* (EVSYS_NSCHKUSER1) User 37 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER37_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER37_Pos)       /* (EVSYS_NSCHKUSER1) User 37 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER37(value)        (EVSYS_NSCHKUSER1_USER37_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER37_Pos)) /* Assigment of value for USER37 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER38_Pos           _UINT32_(6)                                          /* (EVSYS_NSCHKUSER1) User 38 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER38_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER38_Pos)       /* (EVSYS_NSCHKUSER1) User 38 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER38(value)        (EVSYS_NSCHKUSER1_USER38_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER38_Pos)) /* Assigment of value for USER38 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER39_Pos           _UINT32_(7)                                          /* (EVSYS_NSCHKUSER1) User 39 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER39_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER39_Pos)       /* (EVSYS_NSCHKUSER1) User 39 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER39(value)        (EVSYS_NSCHKUSER1_USER39_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER39_Pos)) /* Assigment of value for USER39 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER40_Pos           _UINT32_(8)                                          /* (EVSYS_NSCHKUSER1) User 40 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER40_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER40_Pos)       /* (EVSYS_NSCHKUSER1) User 40 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER40(value)        (EVSYS_NSCHKUSER1_USER40_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER40_Pos)) /* Assigment of value for USER40 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER41_Pos           _UINT32_(9)                                          /* (EVSYS_NSCHKUSER1) User 41 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER41_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER41_Pos)       /* (EVSYS_NSCHKUSER1) User 41 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER41(value)        (EVSYS_NSCHKUSER1_USER41_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER41_Pos)) /* Assigment of value for USER41 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER42_Pos           _UINT32_(10)                                         /* (EVSYS_NSCHKUSER1) User 42 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER42_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER42_Pos)       /* (EVSYS_NSCHKUSER1) User 42 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER42(value)        (EVSYS_NSCHKUSER1_USER42_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER42_Pos)) /* Assigment of value for USER42 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER43_Pos           _UINT32_(11)                                         /* (EVSYS_NSCHKUSER1) User 43 to be checked as non-secured  Position */
#define EVSYS_NSCHKUSER1_USER43_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER43_Pos)       /* (EVSYS_NSCHKUSER1) User 43 to be checked as non-secured  Mask */
#define EVSYS_NSCHKUSER1_USER43(value)        (EVSYS_NSCHKUSER1_USER43_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER43_Pos)) /* Assigment of value for USER43 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER44_Pos           _UINT32_(12)                                         /* (EVSYS_NSCHKUSER1) User 44 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER44_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER44_Pos)       /* (EVSYS_NSCHKUSER1) User 44 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER44(value)        (EVSYS_NSCHKUSER1_USER44_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER44_Pos)) /* Assigment of value for USER44 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER45_Pos           _UINT32_(13)                                         /* (EVSYS_NSCHKUSER1) User 45 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER45_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER45_Pos)       /* (EVSYS_NSCHKUSER1) User 45 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER45(value)        (EVSYS_NSCHKUSER1_USER45_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER45_Pos)) /* Assigment of value for USER45 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER46_Pos           _UINT32_(14)                                         /* (EVSYS_NSCHKUSER1) User 46 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER46_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER46_Pos)       /* (EVSYS_NSCHKUSER1) User 46 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER46(value)        (EVSYS_NSCHKUSER1_USER46_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER46_Pos)) /* Assigment of value for USER46 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER47_Pos           _UINT32_(15)                                         /* (EVSYS_NSCHKUSER1) User 47 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER47_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER47_Pos)       /* (EVSYS_NSCHKUSER1) User 47 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER47(value)        (EVSYS_NSCHKUSER1_USER47_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER47_Pos)) /* Assigment of value for USER47 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER48_Pos           _UINT32_(16)                                         /* (EVSYS_NSCHKUSER1) User 48 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER48_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER48_Pos)       /* (EVSYS_NSCHKUSER1) User 48 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER48(value)        (EVSYS_NSCHKUSER1_USER48_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER48_Pos)) /* Assigment of value for USER48 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER49_Pos           _UINT32_(17)                                         /* (EVSYS_NSCHKUSER1) User 49 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER49_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER49_Pos)       /* (EVSYS_NSCHKUSER1) User 49 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER49(value)        (EVSYS_NSCHKUSER1_USER49_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER49_Pos)) /* Assigment of value for USER49 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER50_Pos           _UINT32_(18)                                         /* (EVSYS_NSCHKUSER1) User 50 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER50_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER50_Pos)       /* (EVSYS_NSCHKUSER1) User 50 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER50(value)        (EVSYS_NSCHKUSER1_USER50_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER50_Pos)) /* Assigment of value for USER50 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_USER51_Pos           _UINT32_(19)                                         /* (EVSYS_NSCHKUSER1) User 51 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER1_USER51_Msk           (_UINT32_(0x1) << EVSYS_NSCHKUSER1_USER51_Pos)       /* (EVSYS_NSCHKUSER1) User 51 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER1_USER51(value)        (EVSYS_NSCHKUSER1_USER51_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER51_Pos)) /* Assigment of value for USER51 in the EVSYS_NSCHKUSER1 register */
#define EVSYS_NSCHKUSER1_Msk                  _UINT32_(0x000FFFFF)                                 /* (EVSYS_NSCHKUSER1) Register Mask  */

#define EVSYS_NSCHKUSER1_USER_Pos             _UINT32_(0)                                          /* (EVSYS_NSCHKUSER1 Position) User 5x to be checked as non-secured */
#define EVSYS_NSCHKUSER1_USER_Msk             (_UINT32_(0xFFFFF) << EVSYS_NSCHKUSER1_USER_Pos)     /* (EVSYS_NSCHKUSER1 Mask) USER */
#define EVSYS_NSCHKUSER1_USER(value)          (EVSYS_NSCHKUSER1_USER_Msk & (_UINT32_(value) << EVSYS_NSCHKUSER1_USER_Pos)) 

