Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_curiosity_pro/pic32cm_ls00_cpro_tz_getting_started/firmware/Secure/firmware/src/packs/PIC32CM5164LS00100_DFP/component/evsys.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CHANNEL register API structure */
typedef struct
{
  __IO  uint32_t                       EVSYS_CHANNEL;      /**< Offset: 0x00 (R/W  32) Channel n Control */
  __IO  uint8_t                        EVSYS_CHINTENCLR;   /**< Offset: 0x04 (R/W  8) Channel n Interrupt Enable Clear */
  __IO  uint8_t                        EVSYS_CHINTENSET;   /**< Offset: 0x05 (R/W  8) Channel n Interrupt Enable Set */
  __IO  uint8_t                        EVSYS_CHINTFLAG;    /**< Offset: 0x06 (R/W  8) Channel n Interrupt Flag Status and Clear */
  __I   uint8_t                        EVSYS_CHSTATUS;     /**< Offset: 0x07 (R/   8) Channel n Status */
} evsys_channel_registers_t;

#define EVSYS_CHANNEL_NUMBER 12

/** \brief EVSYS register API structure */
typedef struct
{  /* Event System Interface */
  __O   uint8_t                        EVSYS_CTRLA;        /**< Offset: 0x00 ( /W  8) Control */
  __I   uint8_t                        Reserved1[0x03];
  __O   uint32_t                       EVSYS_SWEVT;        /**< Offset: 0x04 ( /W  32) Software Event */
  __IO  uint8_t                        EVSYS_PRICTRL;      /**< Offset: 0x08 (R/W  8) Priority Control */
  __I   uint8_t                        Reserved2[0x07];
  __IO  uint16_t                       EVSYS_INTPEND;      /**< Offset: 0x10 (R/W  16) Channel Pending Interrupt */
  __I   uint8_t                        Reserved3[0x02];
  __I   uint32_t                       EVSYS_INTSTATUS;    /**< Offset: 0x14 (R/   32) Interrupt Status */
  __I   uint32_t                       EVSYS_BUSYCH;       /**< Offset: 0x18 (R/   32) Busy Channels */
  __I   uint32_t                       EVSYS_READYUSR;     /**< Offset: 0x1C (R/   32) Ready Users */
        evsys_channel_registers_t      CHANNEL[EVSYS_CHANNEL_NUMBER]; /**< Offset: 0x20  */
  __I   uint8_t                        Reserved4[0xA0];
  __IO  uint8_t                        EVSYS_USER[52];     /**< Offset: 0x120 (R/W  8) User Multiplexer n */
  __I   uint8_t                        Reserved5[0x80];
  __IO  uint8_t                        EVSYS_INTENCLR;     /**< Offset: 0x1D4 (R/W  8) Interrupt Enable Clear */
  __IO  uint8_t                        EVSYS_INTENSET;     /**< Offset: 0x1D5 (R/W  8) Interrupt Enable Set */
  __IO  uint8_t                        EVSYS_INTFLAG;      /**< Offset: 0x1D6 (R/W  8) Interrupt Flag Status and Clear */
  __I   uint8_t                        Reserved6[0x01];
  __IO  uint32_t                       EVSYS_NONSECCHAN;   /**< Offset: 0x1D8 (R/W  32) Channels Security Attribution */
  __IO  uint32_t                       EVSYS_NSCHKCHAN;    /**< Offset: 0x1DC (R/W  32) Non-Secure Channels Check */
  __IO  uint32_t                       EVSYS_NONSECUSER0;  /**< Offset: 0x1E0 (R/W  32) Users Security Attribution */
  __IO  uint32_t                       EVSYS_NONSECUSER1;  /**< Offset: 0x1E4 (R/W  32) Users Security Attribution */
  __I   uint8_t                        Reserved7[0x08];
  __IO  uint32_t                       EVSYS_NSCHKUSER0;   /**< Offset: 0x1F0 (R/W  32) Non-Secure Users Check */
  __IO  uint32_t                       EVSYS_NSCHKUSER1;   /**< Offset: 0x1F4 (R/W  32) Non-Secure Users Check */
} evsys_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMLS00_EVSYS_COMPONENT_H_ */
